      * In MEDIKA/src/copylib.cpy (Example)
       01  PATIENT-RECORD.
           05  PATIENT-NAME PIC X(30).
           05  PATIENT-ID   PIC 9(9).
           05  STUDENT-NUMBER PIC X(10).
           05  HEALTH-CONDITION PIC X(50).
           05  DATE-OF-VISIT PIC X(10).
